# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11n-FCA object detection model with FCAttention

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n-FCA backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 1, FCAttention, [1024]]  # 10-FCA (Key Position 1)
  - [-1, 2, C2PSA, [1024]]  # 11
  - [-1, 1, FCAttention, [1024]]  # 12-FCA (Key Position 2)

# YOLO11n-FCA head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, FCAttention, [512]]  # 15-FCA (增强P4特征)
  - [-1, 2, C3k2, [512, False]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, FCAttention, [256]]  # 19-FCA (增强P3特征)
  - [-1, 2, C3k2, [256, False]]  # 20 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 1, FCAttention, [512]]  # 23-FCA (融合特征校准)
  - [-1, 2, C3k2, [512, False]]  # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 1, FCAttention, [1024]]  # 27-FCA (高层特征增强)
  - [-1, 2, C3k2, [1024, True]]  # 28 (P5/32-large)

  - [[20, 24, 28], 1, Detect, [nc]] # Detect(P3, P4, P5)
