# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-MS 模型配置文件（Neck增强 + 自适应核）

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs


# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False]] # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False]] # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9
  - [-1, 2, C2PSA, [1024]]     # 10

# Head（策略二 + 四）
head:
  # ------------------- P5 -> P4 上采样分支 -------------------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]  # 12：拼接骨干网络P4 (层6输出)
  - [-1, 2, MSBlock, [512, [3,5,7], 2.5, 1.5, 2]]  # 13：中目标核配置

  # ------------------- P4 -> P3 上采样分支 -------------------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15：拼接骨干网络P3 (层4输出)
  - [-1, 2, MSBlock, [256, [1,3,5], 2.0, 1.2, 2]]  # 16：小目标核配置

  # ------------------- P3 -> P4 下采样分支 -------------------
  - [-1, 1, Conv, [256, 3, 2]]  # 17
  - [[-1, 13], 1, Concat, [1]]  # 18：拼接Neck-P4 (层13输出) 
  - [-1, 2, MSBlock, [512, [3,5,7], 2.5, 1.5, 2]]  # 19：中目标核配置

  # ------------------- P4 -> P5 下采样分支 -------------------
  - [-1, 1, Conv, [512, 3, 2]]  # 20
  - [[-1, 10], 1, Concat, [1]]  # 21：拼接骨干网络P5 (层10输出)
  - [-1, 2, MSBlock, [1024, [5,7,9], 3.0, 2.0, 3]]  # 22：大目标核配置

  # ------------------- 检测层 -------------------
  - [[16, 19, 22], 1, Detect, [nc]]  # 23：输入P3(16), P4(19), P5(22)
